In [2]:
import numpy as np
import pandas as pd

In [12]:
df=pd.read_csv("Salary_dataset.csv")
df.head()

   Unnamed: 0  YearsExperience   Salary
0           0              1.2  39344.0
1           1              1.4  46206.0
2           2              1.6  37732.0
3           3              2.1  43526.0
4           4              2.3  39892.0

In [4]:
df0=df['Unnamed: 0']
df0

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
20    20
21    21
22    22
23    23
24    24
25    25
26    26
27    27
28    28
29    29
Name: Unnamed: 0, dtype: int64

In [5]:
df.describe()

       Unnamed: 0  YearsExperience         Salary
count   30.000000        30.000000      30.000000
mean    14.500000         5.413333   76004.000000
std      8.803408         2.837888   27414.429785
min      0.000000         1.200000   37732.000000
25%      7.250000         3.300000   56721.750000
50%     14.500000         4.800000   65238.000000
75%     21.750000         7.800000  100545.750000
max     29.000000        10.600000  122392.000000

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       30 non-null     int64
 1   YearsExperience  30 non-null     float64
 2   Salary           30 non-null     float64
dtypes: float64(2), int64(1)
memory usage: 852.0 bytes

In [8]:
mew=df['Salary'].mean()
print(mew)

76004.0

In [9]:
sigma=df['Salary'].std()
print(sigma)

27414.4297845823

In [18]:
s1=[];s2=[];s3=[]
def custom_hash(value):
    return (value%3)
for i in df0:
    val=custom_hash(i)
    if val==0:s1.append(df['Salary'][i])
    elif val==1:s2.append(df['Salary'][i])
    else:s3.append(df['Salary'][i]) 
print(s1)

[39344.0, 43526.0, 60151.0, 57190.0, 56958.0, 67939.0, 81364.0, 98274.0, 109432.0, 112636.0]

In [19]:
from math import *
xbar=np.mean(s1)
z=(xbar-mew)/(sigma/sqrt(len(s1)))
print(z)

-0.3832647199390059

In [22]:
sigmax2=0;sigmax=0
for i in s1:
    sigmax+=i
    sigmax2+=i**2
ss=sigmax2-(sigmax**2/len(s1))
s=sqrt(ss/(len(s1)-1))
sxbar=s/sqrt(len(s1))
t=(xbar-mew)/sxbar
print(t)

-0.39695420818375887